{
    "/intro_page": "به میراث پدرخوانده خوش اومدی!\n روی دکمه وسط کلیک کن که بریم مافیا بازی کنیم!!",
    "/players_page": "اینجا میتونی بازیکن‌ها رو اضافه، ویرایش و یا حتی پاک کنی. این اسامی برای دفعات بعدی هم ذخیره میشه. حواست باشه برای بازیکن‌هایی که شرکت میکنن تیک کنار اسمشون رو بزنی. ",
    "/game_settings_page": "اینجا میتونی تنظیمات این دست بازی رو تعیین کنی. از سناریو بازی تا مدت زمان بازی صحبت کردن هر بازیکن!",
    "/loading_page": "salam salam salamsalamsalamsalam salam salam salam salam salam salam",
    "/role_selection_page": "توی این صفحه میتونی با توجه به سناریو و تعداد بازیکن‌ها، نقش‌ها و کارت‌های حرکت آخر رو انتخاب کنی.",
    "/role_distribution_page": "اینجا با کلیک روی هر کارت یکی از نقش‌هایی که از قبل انتخاب شده نشون داده میشه. گوشی رو دست به دست کن و هر بازیکن روی یکی از کارت‌ها کلیک کنه تا نقش خودش رو ببینه.",
    "/talking_page": "با این تایمر وسط صفحه باید زمان صحبت هر بازیکن رو مدیریت کنی. حواست باشه کسی بیشتر از حد معمول صحبت نکنه!!",
    "/defense_talking_page": "با این تایمر وسط صفحه باید زمان صحبت هر بازیکن رو مدیریت کنی. حواست باشه کسی بیشتر از حد معمول صحبت نکنه!!",
    "/regular_voting_page": "بعد از رای‌گیری روز، کسایی که باید به دفاعیه برن رو اینجا مشخص کن و روی اسمشون کلیک کن.",
    "/defense_voting_page": "اینجا کسایی که به دفاعیه رفتن مشخص شدن. بعد از رای‌گیری نهایی کسی که کشته روز هست رو انتخاب کن و روی اسمش کلیک کن. دقت کن که اگر 2 دو نفر تعداد رای‌هاشون یکسان شد باید از قرعه مرگ استفاده کنی.",
    "/night_events_page": "توی این صفحه متنی میبینی که با توجه به اتفاقات شب نوشته شده. این متن رو برای بازیکنان بخون تا از اتفاقات شب باخبر بشن.",
    "/night_page": "این صفحه مربوط به اکت‌های شب نقش‌ها هست. متنی که روی قسمت پایین صفحه هست رو برای بازیکن‌ها بخون و با توجه به انتخاب‌ها، بازیکن مورد نظر رو انتخاب کن. این فرایند رو تا جایی ادامه بده که همه نقش‌ها اکت شبشون رو انجام بدن.",
    "/intro_night_page": "این صفحه مربوط به شب معارفه هست. متنی که روی قسمت پایین صفحه هست رو برای بازیکن‌ها بخون و اگر نیاز بود، بازیکن مورد نظر رو انتخاب کن. این فرایند رو تا جایی ادامه بده که همه نقش‌ها رو یه بار بیدار کرده باشی..",
    "/last_move_card_page": "اینجا کسی که توی روز بیشترین رای رو آورده باید قبل از اینکه از بازی بره بیرون، یکی از این کارت‌ها رو انتخاب کنه و در ادامه کارهایی که نیاز هست رو انجام بده.",
    "/reveal_identity_page": "اینجا بازیکن کشته شده در روز کارت افشای هویت رو انتخاب کرده. راوی بازی نقش کسی که کشته شده رو برای بقیه بازیکنا بخونه و بازی رو ادامه بده.",
    "/face_off_page": "بازیکن کشته شده در روز کارت تغییر چهره رو انتخاب کرده. به این معنی که قبل از اینکه از بازی بیرون بره نقشش رو با یکی از بازیکنا جابجا میکنه! تو این بخش بازیکن کشته شده در روز یکی رو باید انتخاب کنه تا نقش‌هاشون جابجا بشه.",
    "/faced_off_role_page": "حالا به بازیکنی که پایین صفحه نوشته شده نقش جدیدش رو نشون بده و بازی رو ادامه بده.",
    "/handcuffs_page": "اینجا باید بازیکن انتخاب شده اکت مربوط به کارت دستبند رو انجام بده. یکی رو انتخاب کن تا در شب پیش رو تواناییش سلب بشه.",
    "/silence_of_the_lambs_page": "بازیکن کشته شده در روز کارت سکوت بره‌ها رو انتخاب کرده. حالا باید دو نفر رو انتخاب کنه تا اون دو تا بازیکن در روز بعدی اجازه صحبت نداشته باشند.",
    "/beautiful_mind_choose_nostradamus_page": "بازیکن کشته شده در روز کارت ذهن زیبا رو انتخاب کرده. یعنی اگر بتونه نوستراداموس رو درست حدس بزنه میتونه داخل بازی بمونه! روی اسم بازیکنی که انتخاب شده کلیک کن و انتخاب کردم رو بزن."
}
