{
    "پدرخوانده": "بازی پدرخوانده یک بازی دورهمی نقش مخفی بر پایه استدلال و استنتاج است.\nدر این بازی، بازیکنان به سه دسته اکثریت شهروند، تیم مافیا و تک نقش مستقل تقسیم می‌شوند.\nنقش‌ها از ابتدا فقط برای صاحب نقش و گرداننده مشخص هستند.\nهدف شهروندان، پاکسازی شهر از مافیاهاست، و مافیاها زمانی پیروز می‌شوند که تعدادشان با شهروندان برابر شود.\nنقش مستقل می‌تواند انتخاب کند که با کدام تیم همکاری کند و در جهت پیروزی آن‌ها تلاش کند.\n\nبازی در دو بخش شب و روز انجام می‌شود.\nدر روز معارفه، بازیکنان نقش خود را می‌دانند اما اعضای تیم مافیا هم‌تیمی‌های خود را نمی‌شناسند.\nپس از 30 ثانیه گفت‌وگو، گرداننده تیم مافیا را بیدار می‌کند تا یکدیگر را بشناسند.\n\nهر روز، گرداننده به ترتیب به بازیکنان اجازه می‌دهد که حداکثر 40 ثانیه صحبت کنند.\nدر این مرحله، همه نقش شهروند را بازی می‌کنند و در فرایند اتهام‌زنی، چالش، دفاع و رأی‌گیری تلاش می‌کنند اعضای مافیا را شناسایی کرده و با رأی اکثریت از شهر خارج کنند.\nبازیکنان دیگر باید در سکوت باشند و فقط با اشاره دست، تأیید یا رد خود را نشان دهند.\n\nدر حین گفت‌وگو، هر بازیکن می‌تواند دیگران را متهم کند یا از آن‌ها رفع اتهام کند، اما هیچ‌کس حق ندارد مستقیماً یا غیرمستقیم به نقش و توانایی‌های شبانه خود اشاره کند، درباره‌ی نقش خود بلوف بزند، یا اتفاقات شب را فاش کند.\n\nپس از گفت‌وگو، رأی‌گیری اولیه انجام می‌شود.\nبازیکنانی که حداقل نصف منهای یک رأی اتهام گرفته باشند، باید از خود دفاع کنند.\nسپس در رأی‌گیری نهایی که به‌صورت علنی برگزار می‌شود، بازیکنی که بیشترین رأی را داشته باشد، از شهر اخراج می‌شود.\nاگر تنها یک نفر به مرحله دفاع برسد، با همان حد نصاب حذف خواهد شد.\nاگر چند نفر دفاع کنند، فردی که بیشترین رأی را کسب کند، حذف می‌شود.\nدر صورت مساوی شدن آرا، قرعه‌کشی انجام می‌شود.\nزمان دفاع 40 ثانیه است.\n\nپس از رأی‌گیری، بازیکن اخراجی یکی از شش کارت حرکت آخر را به‌صورت تصادفی انتخاب می‌کند.\nاگر کارت ذهن زیبا را بکشد و حدس درستی درباره‌ی نقش نوستراداموس بزند، بدون اعلام نقش از سوی گرداننده، به‌جای نوستراداموس به بازی بازمی‌گردد.\nبازیکنی که رأی خروج گرفته است، اجازه‌ی وصیت ندارد و فقط باید کارت حرکت آخر خود را اجرا کند.\n\nدر آغاز هر روز، گرداننده می‌تواند دو بار در کل بازی، با رأی اکثریت بازیکنان، ساید افراد حذف‌شده را فاش کند.\nاستعلام نوستراداموس مستقل خواهد بود.\n\nدر بازی دو نوع استعلام وضعیت وجود دارد که با اعلام ساید انجام می‌شود.\nنوستراداموس با ساید مستقل اعلام می‌شود.\n\nمافیا در شب باید یکی از این قابلیت‌ها را انتخاب کند:\n1. شلیک یک تیر\n2. استفاده‌ی پدرخوانده از حس ششم\n3. خریدن یکی از شهروندان ساده توسط ساول گودمن\n\nتیم مافیا نمی‌تواند همه‌ی این قابلیت‌ها را در یک شب استفاده کند.\nسایر بازیکنان نمی‌دانند که مافیا از چه قابلیتی استفاده کرده است، مگر اینکه پدرخوانده از حس ششم استفاده کند و نقش بازیکنی را افشا نماید.\n\nاگر در شبی که قرار است ساول گودمن خریداری انجام دهد، گرداننده اعلام خواهد کرد که این خرید در حال انجام است.\n\nاگر نوستراداموس در استعلام دو مافیا را شناسایی کند، باید در ساید مافیا بازی کند.\n\nاگر نوستراداموس کارت ذهن زیبا بکشد، خود را حدس می‌زند و به بازی بازمی‌گردد، اما دیگر زره شب نخواهد داشت.",
    "کلاسیک": "در بازی شب‌های مافیا بازیکن‌ها به دو تیم شهروند و مافیا تقسیم می‌شوند. اعضای مافیا ۳ نفر و تعداد شهروندان ۷ نفر می‌باشند. اعضای مافیا در شب معارفه همدیگر را می‌شناسند ولی شهروندان هم تیمی‌های خود را نمی‌شناسند.\nشهروندان تنها در صورتی برنده می‌شوند که تمام اعضای مافیا را بکشند.\nتیم مافیا در صورتی برنده می‌شوند که تعدادشان برابر با شهروندان شود.\nبازی در شب و روزهای متوالی انجام می‌گیرد. در روز تمام شهروندان مشغول صحبت می‌شوند. اعضای مافیا همواره سعی می‌کنند در صحبت‌هایشان خود را شهروند جا بزنند! شهروندان باید با هوشیاری و تحلیل صحبت‌ها شهروندها را از مافیا تشخیص دهند.\nدر پایان روز برای تمام افراد رای‌گیری می‌شود. بازیکنانی که بیش از نصف آرا را بدست آورند به دفاعیه می‌روند. افراد حاضر در دفاعیه باید با بکار بردن استدلال از خود دفاع کنند. پس از اتمام دفاعیه‌ها مجددا رای‌گیری می‌شود. نوع دفاعیه بسته به تعداد افراد حاضر در آن متفاوت است.\nزمانی که فقط یک نفر در دفاع باشد، رای‌گیری مجددا با چشمان باز صورت می‌گیرد و افرادی که رای می‌دهند توسط سایرین دیده خواهند شد. اگر فرد حاضر در دفاع، رای بیش از نیمی از بازیکنان را کسب کند از بازی خارج خواهد شد.\nدر حالتی که بیش از یک نفر به دفاع بیاید رای‌گیری با چشم بسته انجام می‌شود، در این حالت کسی که بیشترین رای را بیاور از بازی خارج می‌شود. بازیکنی که در این مرحله از بازی خارج می‌شود باید یک کارت حرکت آخر انتخاب کند. آنها پس از انجام کارهای مربوط به کارت حرکت آخر کشته شده و از بازی بیرون می‌روند.\nدر هنگام شب هر بازیکن بسته به نقش خود باید کار خاصی انجام دهد. با پایان شب مجددا روز می‌شود و روال بازی ادامه می‌یابد."
}
